tinygo-org/stm32-svd/svd/stm32h743v.svd
        <register>
          <name>RGCFR</name>
          <displayName>RGCFR</displayName>
          <description>DMAMux - DMA request generator clear flag
          register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>COF0</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>COF1</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>COF2</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>COF3</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>COF4</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>COF5</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>COF6</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>COF7</name><description>Clear trigger event overrun flag Upon
              setting, this bit clears the corresponding overrun
              flag OFx in the DMAMUX_RGCSR register.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>DMAMUX request line multiplexer interrupt
          channel status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>SOF0</name><description>Synchronization overrun event
              flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF1</name><description>Synchronization overrun event
              flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF2</name><description>Synchronization overrun event
              flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF3</name><description>Synchronization overrun event
              flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF4</name><description>Synchronization overrun event
              flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF5</name><description>Synchronization overrun event
              flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF6</name><description>Synchronization overrun event
              flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF7</name><description>Synchronization overrun event
              flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF8</name><description>Synchronization overrun event
              flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF9</name><description>Synchronization overrun event
              flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF10</name><description>Synchronization overrun event
              flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF11</name><description>Synchronization overrun event
              flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF12</name><description>Synchronization overrun event
              flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF13</name><description>Synchronization overrun event
              flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF14</name><description>Synchronization overrun event
              flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>SOF15</name><description>Synchronization overrun event
              flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>CFR</name>
          <displayName>CFR</displayName>
          <description>DMAMUX request line multiplexer interrupt
          clear flag register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>CSOF0</name><description>Clear synchronization overrun event
              flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF1</name><description>Clear synchronization overrun event
              flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF2</name><description>Clear synchronization overrun event
              flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF3</name><description>Clear synchronization overrun event
              flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF4</name><description>Clear synchronization overrun event
              flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF5</name><description>Clear synchronization overrun event
              flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF6</name><description>Clear synchronization overrun event
              flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF7</name><description>Clear synchronization overrun event
              flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF8</name><description>Clear synchronization overrun event
              flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF9</name><description>Clear synchronization overrun event
              flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF10</name><description>Clear synchronization overrun event
              flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF11</name><description>Clear synchronization overrun event
              flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF12</name><description>Clear synchronization overrun event
              flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF13</name><description>Clear synchronization overrun event
              flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF14</name><description>Clear synchronization overrun event
              flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CSOF15</name><description>Clear synchronization overrun event
              flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
