tinygo-org/stm32-svd/svd/stm32h743v.svd
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>This register is write protected (except for
          RTC_ISR[13:8] bits). The write access procedure is
          described in RTC register write protection on
          page9.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>ALRAWF</name>
              <description>Alarm A write flag This bit is set by
              hardware when Alarm A values can be changed, after
              the ALRAE bit has been set to 0 in RTC_CR. It is
              cleared by hardware in initialization
              mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>ALRAWFR</name><usage>read</usage><enumeratedValue><name>UpdateNotAllowed</name><description>Alarm update not allowed</description><value>0</value></enumeratedValue><enumeratedValue><name>UpdateAllowed</name><description>Alarm update allowed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRBWF</name>
              <description>Alarm B write flag This bit is set by
              hardware when Alarm B values can be changed, after
              the ALRBE bit has been set to 0 in RTC_CR. It is
              cleared by hardware in initialization
              mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues derivedFrom="ALRAWFR" />
            </field>
            <field>
              <name>WUTWF</name>
              <description>Wakeup timer write flag This bit is set
              by hardware up to 2 RTCCLK cycles after the WUTE bit
              has been set to 0 in RTC_CR, and is cleared up to 2
              RTCCLK cycles after the WUTE bit has been set to 1.
              The wakeup timer values can be changed when WUTE bit
              is cleared and WUTWF is set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>WUTWFR</name><usage>read</usage><enumeratedValue><name>UpdateNotAllowed</name><description>Wakeup timer configuration update not allowed</description><value>0</value></enumeratedValue><enumeratedValue><name>UpdateAllowed</name><description>Wakeup timer configuration update allowed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SHPF</name>
              <description>Shift operation pending This flag is set
              by hardware as soon as a shift operation is initiated
              by a write to the RTC_SHIFTR register. It is cleared
              by hardware when the corresponding shift operation
              has been executed. Writing to the SHPF bit has no
              effect.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>SHPFR</name><usage>read</usage><enumeratedValue><name>NoShiftPending</name><description>No shift operation is pending</description><value>0</value></enumeratedValue><enumeratedValue><name>ShiftPending</name><description>A shift operation is pending</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>INITS</name>
              <description>Initialization status flag This bit is
              set by hardware when the calendar year field is
              different from 0 (Backup domain reset
              state).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>INITSR</name><usage>read</usage><enumeratedValue><name>NotInitalized</name><description>Calendar has not been initialized</description><value>0</value></enumeratedValue><enumeratedValue><name>Initalized</name><description>Calendar has been initialized</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronization flag This bit
              is set by hardware each time the calendar registers
              are copied into the shadow registers (RTC_SSRx,
              RTC_TRx and RTC_DRx). This bit is cleared by hardware
              in initialization mode, while a shift operation is
              pending (SHPF=1), or when in bypass shadow register
              mode (BYPSHAD=1). This bit can also be cleared by
              software. It is cleared either by software or by
              hardware in initialization mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>RSFR</name><usage>read</usage><enumeratedValue><name>NotSynced</name><description>Calendar shadow registers not yet synchronized</description><value>0</value></enumeratedValue><enumeratedValue><name>Synced</name><description>Calendar shadow registers synchronized</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>RSFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>INITF</name>
              <description>Initialization flag When this bit is set
              to 1, the RTC is in initialization state, and the
              time, date and prescaler registers can be
              updated.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>INITFR</name><usage>read</usage><enumeratedValue><name>NotAllowed</name><description>Calendar registers update is not allowed</description><value>0</value></enumeratedValue><enumeratedValue><name>Allowed</name><description>Calendar registers update is allowed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>INIT</name>
              <description>Initialization mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>INIT</name><usage>read-write</usage><enumeratedValue><name>FreeRunningMode</name><description>Free running mode</description><value>0</value></enumeratedValue><enumeratedValue><name>InitMode</name><description>Initialization mode used to program time and date register (RTC_TR and RTC_DR), and prescaler register (RTC_PRER). Counters are stopped and start counting from the new value when INIT is reset.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRAF</name>
              <description>Alarm A flag This flag is set by
              hardware when the time/date registers (RTC_TR and
              RTC_DR) match the Alarm A register (RTC_ALRMAR). This
              flag is cleared by software by writing
              0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ALRAFR</name><usage>read</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm A register (RTC_ALRMAR)</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ALRAFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRBF</name>
              <description>Alarm B flag This flag is set by
              hardware when the time/date registers (RTC_TR and
              RTC_DR) match the Alarm B register (RTC_ALRMBR). This
              flag is cleared by software by writing
              0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ALRBFR</name><usage>read</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm B register (RTC_ALRMBR)</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ALRBFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WUTF</name>
              <description>Wakeup timer flag This flag is set by
              hardware when the wakeup auto-reload counter reaches
              0. This flag is cleared by software by writing 0.
              This flag must be cleared by software at least 1.5
              RTCCLK periods before WUTF is set to 1
              again.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>WUTFR</name><usage>read</usage><enumeratedValue><name>Zero</name><description>This flag is set by hardware when the wakeup auto-reload counter reaches 0</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>WUTFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSF</name>
              <description>Time-stamp flag This flag is set by
              hardware when a time-stamp event occurs. This flag is
              cleared by software by writing 0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TSFR</name><usage>read</usage><enumeratedValue><name>TimestampEvent</name><description>This flag is set by hardware when a time-stamp event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>TSFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSOVF</name>
              <description>Time-stamp overflow flag This flag is
              set by hardware when a time-stamp event occurs while
              TSF is already set. This flag is cleared by software
              by writing 0. It is recommended to check and then
              clear TSOVF only after clearing the TSF bit.
              Otherwise, an overflow might not be noticed if a
              time-stamp event occurs immediately before the TSF
              bit is cleared.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TSOVFR</name><usage>read</usage><enumeratedValue><name>Overflow</name><description>This flag is set by hardware when a time-stamp event occurs while TSF is already set</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>TSOVFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TAMP1F</name>
              <description>RTC_TAMP1 detection flag This flag is
              set by hardware when a tamper detection event is
              detected on the RTC_TAMP1 input. It is cleared by
              software writing 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TAMP1FR</name><usage>read</usage><enumeratedValue><name>Tampered</name><description>This flag is set by hardware when a tamper detection event is detected on the RTC_TAMPx input</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>TAMP1FW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Flag cleared by software writing 0</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TAMP2F</name>
              <description>RTC_TAMP2 detection flag This flag is
              set by hardware when a tamper detection event is
              detected on the RTC_TAMP2 input. It is cleared by
              software writing 0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="TAMP1FR" />
            <enumeratedValues derivedFrom="TAMP1FW" />
            </field>
            <field>
              <name>TAMP3F</name>
              <description>RTC_TAMP3 detection flag This flag is
              set by hardware when a tamper detection event is
              detected on the RTC_TAMP3 input. It is cleared by
              software writing 0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues derivedFrom="TAMP1FR" />
            <enumeratedValues derivedFrom="TAMP1FW" />
            </field>
            <field>
              <name>RECALPF</name>
              <description>Recalibration pending Flag The RECALPF
              status flag is automatically set to 1 when software
              writes to the RTC_CALR register, indicating that the
              RTC_CALR register is blocked. When the new
              calibration settings are taken into account, this bit
              returns to 0. Refer to Re-calibration
              on-the-fly.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>RECALPFR</name><usage>read</usage><enumeratedValue><name>Pending</name><description>The RECALPF status flag is automatically set to 1 when software writes to the RTC_CALR register, indicating that the RTC_CALR register is blocked. When the new calibration settings are taken into account, this bit returns to 0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ITSF</name>
              <description>Internal tTime-stamp flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ITSFR</name><usage>read</usage><enumeratedValue><name>Match</name><description>This flag is set by hardware when a time-stamp on the internal event occurs</description><value>1</value></enumeratedValue></enumeratedValues>
            <enumeratedValues><name>ITSFW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>This flag is cleared by software by writing 0, and must be cleared together with TSF bit by writing 0 in both bits</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRER</name>
          <displayName>PRER</displayName>
          <description>This register must be written in
          initialization mode only. The initialization must be
          performed in two separate write accesses. Refer to
          Calendar initialization and configuration on page9.This
          register is write protected. The write access procedure
          is described in RTC register write protection on
          page9.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x007F00FF</resetValue>
          <fields>
            <field>
              <name>PREDIV_S</name>
              <description>Synchronous prescaler factor This is the
              synchronous division factor: ck_spre frequency =
              ck_apre frequency/(PREDIV_S+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>32767</maximum></range></writeConstraint>
            </field>
            <field>
              <name>PREDIV_A</name>
              <description>Asynchronous prescaler factor This is
              the asynchronous division factor: ck_apre frequency =
              RTCCLK frequency/(PREDIV_A+1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>127</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WUTR</name>
          <displayName>WUTR</displayName>
          <description>This register can be written only when WUTWF
          is set to 1 in RTC_ISR.This register is write protected.
          The write access procedure is described in RTC register
          write protection on page9.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>WUT</name>
              <description>Wakeup auto-reload value bits When the
              wakeup timer is enabled (WUTE set to 1), the WUTF
              flag is set every (WUT[15:0] + 1) ck_wut cycles. The
              ck_wut period is selected through WUCKSEL[2:0] bits
              of the RTC_CR register When WUCKSEL[2] = 1, the
              wakeup timer becomes 17-bits and WUCKSEL[1]
              effectively becomes WUT[16] the most-significant bit
              to be reloaded into the timer. The first assertion of
              WUTF occurs (WUT+1) ck_wut cycles after WUTE is set.
              Setting WUT[15:0] to 0x0000 with WUCKSEL[2:0] =011
              (RTCCLK/2) is forbidden.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
