tinygo-org/stm32-svd/svd/stm32h743v.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>Serial peripheral interface</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40013000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI1</name>
        <description>SPI1 global interrupt</description>
        <value>35</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IOLOCK</name>
              <description>Locking the AF configuration of
              associated IOs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>IOLOCK</name><usage>read-write</usage><enumeratedValue><name>Unlocked</name><description>IO configuration unlocked</description><value>0</value></enumeratedValue><enumeratedValue><name>Locked</name><description>IO configuration locked</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TCRCINI</name>
              <description>CRC calculation initialization pattern
              control for transmitter</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TCRCINI</name><usage>read-write</usage><enumeratedValue><name>AllZeros</name><description>All zeros TX CRC initialization pattern</description><value>0</value></enumeratedValue><enumeratedValue><name>AllOnes</name><description>All ones TX CRC initialization pattern</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RCRCINI</name>
              <description>CRC calculation initialization pattern
              control for receiver</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>RCRCINI</name><usage>read-write</usage><enumeratedValue><name>AllZeros</name><description>All zeros RX CRC initialization pattern</description><value>0</value></enumeratedValue><enumeratedValue><name>AllOnes</name><description>All ones RX CRC initialization pattern</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CRC33_17</name>
              <description>32-bit CRC polynomial
              configuration</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>CRC33_17</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Full size (33/17 bit) CRC polynomial is not used</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Full size (33/17 bit) CRC polynomial is used</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SSI</name>
              <description>Internal SS signal input
              level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>SSI</name><usage>read-write</usage><enumeratedValue><name>SlaveSelected</name><description>0 is forced onto the SS signal and the I/O value of the SS pin is ignored</description><value>0</value></enumeratedValue><enumeratedValue><name>SlaveNotSelected</name><description>1 is forced onto the SS signal and the I/O value of the SS pin is ignored</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HDDIR</name>
              <description>Rx/Tx direction at Half-duplex
              mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>HDDIR</name><usage>read-write</usage><enumeratedValue><name>Receiver</name><description>Receiver in half duplex mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Transmitter</name><description>Transmitter in half duplex mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CSUSP</name>
              <description>Master SUSPend request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            <enumeratedValues><name>CSUSPW</name><usage>write</usage><enumeratedValue><name>NotRequested</name><description>Do not request master suspend</description><value>0</value></enumeratedValue><enumeratedValue><name>Requested</name><description>Request master suspend</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CSTART</name>
              <description>Master transfer start</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>CSTART</name><usage>read-write</usage><enumeratedValue><name>NotStarted</name><description>Do not start master transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>Started</name><description>Start master transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MASRX</name>
              <description>Master automatic SUSP in Receive
              mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MASRX</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Automatic suspend in master receive-only mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Automatic suspend in master receive-only mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SPE</name>
              <description>Serial Peripheral Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>SPE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Peripheral disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Peripheral enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSER</name>
              <description>Number of data transfer extension to be
              reload into TSIZE just when a previous</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>TSIZE</name>
              <description>Number of data at current
              transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <displayName>CFG1</displayName>
          <description>configuration register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00070007</resetValue>
          <fields>
            <field>
              <name>MBR</name>
              <description>Master baud rate</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>MBR</name><usage>read-write</usage><enumeratedValue><name>Div2</name><description>f_spi_ker_ck / 2</description><value>0</value></enumeratedValue><enumeratedValue><name>Div4</name><description>f_spi_ker_ck / 4</description><value>1</value></enumeratedValue><enumeratedValue><name>Div8</name><description>f_spi_ker_ck / 8</description><value>2</value></enumeratedValue><enumeratedValue><name>Div16</name><description>f_spi_ker_ck / 16</description><value>3</value></enumeratedValue><enumeratedValue><name>Div32</name><description>f_spi_ker_ck / 32</description><value>4</value></enumeratedValue><enumeratedValue><name>Div64</name><description>f_spi_ker_ck / 64</description><value>5</value></enumeratedValue><enumeratedValue><name>Div128</name><description>f_spi_ker_ck / 128</description><value>6</value></enumeratedValue><enumeratedValue><name>Div256</name><description>f_spi_ker_ck / 256</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CRCEN</name>
              <description>Hardware CRC computation
              enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CRCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CRC calculation disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CRC calculation enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CRCSIZE</name>
              <description>Length of CRC frame to be transacted and
              compared</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>Tx DMA stream enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Tx buffer DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Tx buffer DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>Rx DMA stream enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXDMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Rx buffer DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Rx buffer DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UDRDET</name>
              <description>Detection of underrun condition at slave
              transmitter</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>UDRDET</name><usage>read-write</usage><enumeratedValue><name>StartOfFrame</name><description>Underrun is detected at begin of data frame</description><value>0</value></enumeratedValue><enumeratedValue><name>EndOfFrame</name><description>Underrun is detected at end of last data frame</description><value>1</value></enumeratedValue><enumeratedValue><name>StartOfSlaveSelect</name><description>Underrun is detected at begin of active SS signal</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UDRCFG</name>
              <description>Behavior of slave transmitter at
              underrun condition</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>UDRCFG</name><usage>read-write</usage><enumeratedValue><name>Constant</name><description>Slave sends a constant underrun pattern</description><value>0</value></enumeratedValue><enumeratedValue><name>RepeatReceived</name><description>Slave repeats last received data frame from master</description><value>1</value></enumeratedValue><enumeratedValue><name>RepeatTransmitted</name><description>Slave repeats last transmitted data frame</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FTHLV</name>
              <description>threshold level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues><name>FTHLV</name><usage>read-write</usage><enumeratedValue><name>OneFrame</name><description>1 frame</description><value>0</value></enumeratedValue><enumeratedValue><name>TwoFrames</name><description>2 frames</description><value>1</value></enumeratedValue><enumeratedValue><name>ThreeFrames</name><description>3 frames</description><value>2</value></enumeratedValue><enumeratedValue><name>FourFrames</name><description>4 frames</description><value>3</value></enumeratedValue><enumeratedValue><name>FiveFrames</name><description>5 frames</description><value>4</value></enumeratedValue><enumeratedValue><name>SixFrames</name><description>6 frames</description><value>5</value></enumeratedValue><enumeratedValue><name>SevenFrames</name><description>7 frames</description><value>6</value></enumeratedValue><enumeratedValue><name>EightFrames</name><description>8 frames</description><value>7</value></enumeratedValue><enumeratedValue><name>NineFrames</name><description>9 frames</description><value>8</value></enumeratedValue><enumeratedValue><name>TenFrames</name><description>10 frames</description><value>9</value></enumeratedValue><enumeratedValue><name>ElevenFrames</name><description>11 frames</description><value>10</value></enumeratedValue><enumeratedValue><name>TwelveFrames</name><description>12 frames</description><value>11</value></enumeratedValue><enumeratedValue><name>ThirteenFrames</name><description>13 frames</description><value>12</value></enumeratedValue><enumeratedValue><name>FourteenFrames</name><description>14 frames</description><value>13</value></enumeratedValue><enumeratedValue><name>FifteenFrames</name><description>15 frames</description><value>14</value></enumeratedValue><enumeratedValue><name>SixteenFrames</name><description>16 frames</description><value>15</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DSIZE</name>
              <description>Number of bits in at single SPI data
              frame</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>31</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
