tinygo-org/stm32-svd/svd/stm32h743v.svd
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>ADC configuration register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROVSE</name>
              <description>ADC oversampler enable on scope ADC
              group regular</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ROVSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Regular oversampling disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Regular oversampling enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JOVSE</name>
              <description>ADC oversampler enable on scope ADC
              group injected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JOVSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Injected oversampling disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Injected oversampling enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVSS</name>
              <description>ADC oversampling shift</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>11</maximum></range></writeConstraint>
            </field>
            <field>
              <name>TROVS</name>
              <description>ADC oversampling discontinuous mode
              (triggered mode) for ADC group regular</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TROVS</name><usage>read-write</usage><enumeratedValue><name>Automatic</name><description>All oversampled conversions for a channel are run following a trigger</description><value>0</value></enumeratedValue><enumeratedValue><name>Triggered</name><description>Each oversampled conversion for a channel needs a new trigger</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ROVSM</name>
              <description>Regular Oversampling mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ROVSM</name><usage>read-write</usage><enumeratedValue><name>Continued</name><description>Oversampling is temporary stopped and continued after injection sequence</description><value>0</value></enumeratedValue><enumeratedValue><name>Resumed</name><description>Oversampling is aborted and resumed from start after injection sequence</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RSHIFT1</name>
              <description>Right-shift data after Offset 1
              correction</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RSHIFT1</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Right-shifting disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Data is right-shifted 1-bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RSHIFT2</name>
              <description>Right-shift data after Offset 2
              correction</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="RSHIFT1" />
            </field>
            <field>
              <name>RSHIFT3</name>
              <description>Right-shift data after Offset 3
              correction</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="RSHIFT1" />
            </field>
            <field>
              <name>RSHIFT4</name>
              <description>Right-shift data after Offset 4
              correction</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="RSHIFT1" />
            </field>
            <field>
              <name>OSVR</name>
              <description>Oversampling ratio</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>1023</maximum></range></writeConstraint>
            </field>
            <field>
              <name>LSHIFT</name>
              <description>Left shift factor</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <displayName>SMPR1</displayName>
          <description>ADC sampling time register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMP9</name>
              <description>ADC channel 9 sampling time
              selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SMP9</name><usage>read-write</usage><enumeratedValue><name>Cycles1_5</name><description>1.5 ADC clock cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>Cycles2_5</name><description>2.5 ADC clock cycles</description><value>1</value></enumeratedValue><enumeratedValue><name>Cycles8_5</name><description>8.5 ADC clock cycles</description><value>2</value></enumeratedValue><enumeratedValue><name>Cycles16_5</name><description>16.5 ADC clock cycles</description><value>3</value></enumeratedValue><enumeratedValue><name>Cycles32_5</name><description>32.5 ADC clock cycles</description><value>4</value></enumeratedValue><enumeratedValue><name>Cycles64_5</name><description>64.5 ADC clock cycles</description><value>5</value></enumeratedValue><enumeratedValue><name>Cycles387_5</name><description>387.5 ADC clock cycles</description><value>6</value></enumeratedValue><enumeratedValue><name>Cycles810_5</name><description>810.5 ADC clock cycles</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SMP8</name>
              <description>ADC channel 8 sampling time
              selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP7</name>
              <description>ADC channel 7 sampling time
              selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP6</name>
              <description>ADC channel 6 sampling time
              selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP5</name>
              <description>ADC channel 5 sampling time
              selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP4</name>
              <description>ADC channel 4 sampling time
              selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP3</name>
              <description>ADC channel 3 sampling time
              selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP2</name>
              <description>ADC channel 2 sampling time
              selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
            <field>
              <name>SMP1</name>
              <description>ADC channel 1 sampling time
              selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP9" />
            </field>
          <field><name>SMP0</name><description>ADC channel 0 sampling time</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access><enumeratedValues derivedFrom="SMP9" />
            </field>
            </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <displayName>SMPR2</displayName>
          <description>ADC sampling time register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMP19</name>
              <description>ADC channel 19 sampling time</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SMP19</name><usage>read-write</usage><enumeratedValue><name>Cycles1_5</name><description>1.5 ADC clock cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>Cycles2_5</name><description>2.5 ADC clock cycles</description><value>1</value></enumeratedValue><enumeratedValue><name>Cycles8_5</name><description>8.5 ADC clock cycles</description><value>2</value></enumeratedValue><enumeratedValue><name>Cycles16_5</name><description>16.5 ADC clock cycles</description><value>3</value></enumeratedValue><enumeratedValue><name>Cycles32_5</name><description>32.5 ADC clock cycles</description><value>4</value></enumeratedValue><enumeratedValue><name>Cycles64_5</name><description>64.5 ADC clock cycles</description><value>5</value></enumeratedValue><enumeratedValue><name>Cycles387_5</name><description>387.5 ADC clock cycles</description><value>6</value></enumeratedValue><enumeratedValue><name>Cycles810_5</name><description>810.5 ADC clock cycles</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SMP18</name>
              <description>ADC channel 18 sampling time
              selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP17</name>
              <description>ADC channel 17 sampling time
              selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP16</name>
              <description>ADC channel 16 sampling time
              selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP15</name>
              <description>ADC channel 15 sampling time
              selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP14</name>
              <description>ADC channel 14 sampling time
              selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP13</name>
              <description>ADC channel 13 sampling time
              selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP12</name>
              <description>ADC channel 12 sampling time
              selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP11</name>
              <description>ADC channel 11 sampling time
              selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
            <field>
              <name>SMP10</name>
              <description>ADC channel 10 sampling time
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP19" />
            </field>
          </fields>
        </register>
        <register>
          <name>LTR1</name>
          <displayName>LTR1</displayName>
          <description>ADC analog watchdog 1 threshold
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>LTR1</name>
              <description>ADC analog watchdog 1 threshold
              low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR1</name>
          <displayName>LHTR1</displayName>
          <description>ADC analog watchdog 2 threshold
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>HTR1</name>
              <description>ADC analog watchdog 2 threshold
              low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>67108863</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <displayName>SQR1</displayName>
          <description>ADC group regular sequencer ranks register
          1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ4</name>
              <description>ADC group regular sequencer rank
              4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC group regular sequencer rank
              3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC group regular sequencer rank
              2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ1</name>
              <description>ADC group regular sequencer rank
              1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>L</name>
              <description>L3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <displayName>SQR2</displayName>
          <description>ADC group regular sequencer ranks register
          2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ9</name>
              <description>ADC group regular sequencer rank
              9</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank
              8</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank
              7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank
              6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ5</name>
              <description>ADC group regular sequencer rank
              5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <displayName>SQR3</displayName>
          <description>ADC group regular sequencer ranks register
          3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ14</name>
              <description>ADC group regular sequencer rank
              14</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ13</name>
              <description>ADC group regular sequencer rank
              13</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ12</name>
              <description>ADC group regular sequencer rank
              12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ11</name>
              <description>ADC group regular sequencer rank
              11</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ10</name>
              <description>ADC group regular sequencer rank
              10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR4</name>
          <displayName>SQR4</displayName>
          <description>ADC group regular sequencer ranks register
          4</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ16</name>
              <description>ADC group regular sequencer rank
              16</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ15</name>
              <description>ADC group regular sequencer rank
              15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>19</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>ADC group regular conversion data
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>ADC group regular conversion
              data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
