tinygo-org/stm32-svd/svd/stm32h743v.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC3">
      <name>ADC1</name>
      <baseAddress>0x40022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC3">
      <name>ADC2</name>
      <baseAddress>0x40022100</baseAddress>
    </peripheral>
    <peripheral>
      <name>ADC3_Common</name>
      <description>Analog-to-Digital Converter</description>
      <groupName>ADC</groupName>
      <baseAddress>0x58026300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>ADC Common status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADRDY_MST</name>
              <description>Master ADC ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADRDY_MST</name><usage>read-write</usage><enumeratedValue><name>NotReady</name><description>ADC is not ready to start conversion</description><value>0</value></enumeratedValue><enumeratedValue><name>Ready</name><description>ADC is ready to start conversion</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOSMP_MST</name>
              <description>End of Sampling phase flag of the master
              ADC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOSMP_MST</name><usage>read-write</usage><enumeratedValue><name>NotEnded</name><description>End of sampling phase no yet reached</description><value>0</value></enumeratedValue><enumeratedValue><name>Ended</name><description>End of sampling phase reached</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOC_MST</name>
              <description>End of regular conversion of the master
              ADC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOC_MST</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Regular conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Regular conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOS_MST</name>
              <description>End of regular sequence flag of the
              master ADC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOS_MST</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Regular sequence is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Regular sequence complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OVR_MST</name>
              <description>Overrun flag of the master
              ADC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVR_MST</name><usage>read-write</usage><enumeratedValue><name>NoOverrun</name><description>No overrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOC_MST</name>
              <description>End of injected conversion flag of the
              master ADC</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOC_MST</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Injected conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Injected conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOS_MST</name>
              <description>End of injected sequence flag of the
              master ADC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOS_MST</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Injected sequence is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Injected sequence complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD1_MST</name>
              <description>Analog watchdog 1 flag of the master
              ADC</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AWD1_MST</name><usage>read-write</usage><enumeratedValue><name>NoEvent</name><description>No analog watchdog event occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>Analog watchdog event occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD2_MST</name>
              <description>Analog watchdog 2 flag of the master
              ADC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1_MST" />
            </field>
            <field>
              <name>AWD3_MST</name>
              <description>Analog watchdog 3 flag of the master
              ADC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1_MST" />
            </field>
            <field>
              <name>JQOVF_MST</name>
              <description>Injected Context Queue Overflow flag of
              the master ADC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JQOVF_MST</name><usage>read-write</usage><enumeratedValue><name>NoOverflow</name><description>No injected context queue overflow has occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overflow</name><description>Injected context queue overflow has occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADRDY_SLV</name>
              <description>Slave ADC ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="ADRDY_MST" />
            </field>
            <field>
              <name>EOSMP_SLV</name>
              <description>End of Sampling phase flag of the slave
              ADC</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOSMP_MST" />
            </field>
            <field>
              <name>EOC_SLV</name>
              <description>End of regular conversion of the slave
              ADC</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOC_MST" />
            </field>
            <field>
              <name>EOS_SLV</name>
              <description>End of regular sequence flag of the
              slave ADC</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOS_MST" />
            </field>
            <field>
              <name>OVR_SLV</name>
              <description>Overrun flag of the slave
              ADC</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OVR_MST" />
            </field>
            <field>
              <name>JEOC_SLV</name>
              <description>End of injected conversion flag of the
              slave ADC</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JEOC_MST" />
            </field>
            <field>
              <name>JEOS_SLV</name>
              <description>End of injected sequence flag of the
              slave ADC</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JEOS_MST" />
            </field>
            <field>
              <name>AWD1_SLV</name>
              <description>Analog watchdog 1 flag of the slave
              ADC</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1_MST" />
            </field>
            <field>
              <name>AWD2_SLV</name>
              <description>Analog watchdog 2 flag of the slave
              ADC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1_MST" />
            </field>
            <field>
              <name>AWD3_SLV</name>
              <description>Analog watchdog 3 flag of the slave
              ADC</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1_MST" />
            </field>
            <field>
              <name>JQOVF_SLV</name>
              <description>Injected Context Queue Overflow flag of
              the slave ADC</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JQOVF_MST" />
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>ADC common control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DUAL</name>
              <description>Dual ADC mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <enumeratedValues><name>DUAL</name><usage>read-write</usage><enumeratedValue><name>Independent</name><description>Independent mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DualRJ</name><description>Dual, combined regular simultaneous + injected simultaneous mode</description><value>1</value></enumeratedValue><enumeratedValue><name>DualRA</name><description>Dual, combined regular simultaneous + alternate trigger mode</description><value>2</value></enumeratedValue><enumeratedValue><name>DualIJ</name><description>Dual, combined interleaved mode + injected simultaneous mode</description><value>3</value></enumeratedValue><enumeratedValue><name>DualJ</name><description>Dual, injected simultaneous mode only</description><value>5</value></enumeratedValue><enumeratedValue><name>DualR</name><description>Dual, regular simultaneous mode only</description><value>6</value></enumeratedValue><enumeratedValue><name>DualI</name><description>Dual, interleaved mode only</description><value>7</value></enumeratedValue><enumeratedValue><name>DualA</name><description>Dual, alternate trigger mode only</description><value>9</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DELAY</name>
              <description>Delay between 2 sampling
              phases</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DAMDF</name>
              <description>Dual ADC Mode Data Format</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>DAMDF</name><usage>read-write</usage><enumeratedValue><name>NoPack</name><description>Without data packing, CDR/CDR2 not used</description><value>0</value></enumeratedValue><enumeratedValue><name>Format32to10</name><description>CDR formatted for 32-bit down to 10-bit resolution</description><value>2</value></enumeratedValue><enumeratedValue><name>Format8</name><description>CDR formatted for 8-bit resolution</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKMODE</name>
              <description>ADC clock mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CKMODE</name><usage>read-write</usage><enumeratedValue><name>Asynchronous</name><description>Use Kernel Clock adc_ker_ck_input divided by PRESC. Asynchronous to AHB clock</description><value>0</value></enumeratedValue><enumeratedValue><name>SyncDiv1</name><description>Use AHB clock rcc_hclk3. In this case rcc_hclk must equal sys_d1cpre_ck</description><value>1</value></enumeratedValue><enumeratedValue><name>SyncDiv2</name><description>Use AHB clock rcc_hclk3 divided by 2</description><value>2</value></enumeratedValue><enumeratedValue><name>SyncDiv4</name><description>Use AHB clock rcc_hclk3 divided by 4</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>ADC prescaler</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            <enumeratedValues><name>PRESC</name><usage>read-write</usage><enumeratedValue><name>Div1</name><description>adc_ker_ck_input not divided</description><value>0</value></enumeratedValue><enumeratedValue><name>Div2</name><description>adc_ker_ck_input divided by 2</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>adc_ker_ck_input divided by 4</description><value>2</value></enumeratedValue><enumeratedValue><name>Div6</name><description>adc_ker_ck_input divided by 6</description><value>3</value></enumeratedValue><enumeratedValue><name>Div8</name><description>adc_ker_ck_input divided by 8</description><value>4</value></enumeratedValue><enumeratedValue><name>Div10</name><description>adc_ker_ck_input divided by 10</description><value>5</value></enumeratedValue><enumeratedValue><name>Div12</name><description>adc_ker_ck_input divided by 12</description><value>6</value></enumeratedValue><enumeratedValue><name>Div16</name><description>adc_ker_ck_input divided by 16</description><value>7</value></enumeratedValue><enumeratedValue><name>Div32</name><description>adc_ker_ck_input divided by 32</description><value>8</value></enumeratedValue><enumeratedValue><name>Div64</name><description>adc_ker_ck_input divided by 64</description><value>9</value></enumeratedValue><enumeratedValue><name>Div128</name><description>adc_ker_ck_input divided by 128</description><value>10</value></enumeratedValue><enumeratedValue><name>Div256</name><description>adc_ker_ck_input divided by 256</description><value>11</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>VREFEN</name>
              <description>VREFINT enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>VREFEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>V_REFINT channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>V_REFINT channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>VSENSEEN</name>
              <description>Temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>VSENSEEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Temperature sensor channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Temperature sensor channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>VBATEN</name>
              <description>VBAT enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>VBATEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>V_BAT channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>V_BAT channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <displayName>CDR</displayName>
          <description>ADC common regular data register for dual
          and triple modes</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA_SLV</name>
              <description>Regular data of the slave
              ADC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RDATA_MST</name>
              <description>Regular data of the master
              ADC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR2</name>
          <displayName>CDR2</displayName>
          <description>ADC x common regular data register for
          32-bit dual mode</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA_ALT</name>
              <description>Regular data of the master/slave
              alternated ADCs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
