tinygo-org/stm32-svd/svd/stm32h743v.svd
        <register>
          <name>D2CCIP1R</name>
          <displayName>D2CCIP1R</displayName>
          <description>RCC Domain 2 Kernel Clock Configuration
          Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAI1SEL</name>
              <description>SAI1 and DFSDM1 kernel Aclk clock source
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SAI1SEL</name><usage>read-write</usage><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_P</name><description>pll2_p selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_P</name><description>pll3_p selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>I2S_CKIN</name><description>I2S_CKIN selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>PER</name><description>PER selected as peripheral clock</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAI23SEL</name>
              <description>SAI2 and SAI3 kernel clock source
              selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SAI1SEL" />
            </field>
            <field>
              <name>SPI123SEL</name>
              <description>SPI/I2S1,2 and 3 kernel clock source
              selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SAI1SEL" />
            </field>
            <field>
              <name>SPI45SEL</name>
              <description>SPI4 and 5 kernel clock source
              selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SPI45SEL</name><usage>read-write</usage><enumeratedValue><name>APB</name><description>APB clock selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_Q</name><description>pll2_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_Q</name><description>pll3_q selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SPDIFSEL</name>
              <description>SPDIFRX kernel clock source
              selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>SPDIFSEL</name><usage>read-write</usage><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_R</name><description>pll2_r selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_R</name><description>pll3_r selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DFSDM1SEL</name>
              <description>DFSDM1 kernel Clk clock source
              selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DFSDM1SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK2</name><description>rcc_pclk2 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>SYS</name><description>System clock selected as peripheral clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FDCANSEL</name>
              <description>FDCAN kernel clock source
              selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>FDCANSEL</name><usage>read-write</usage><enumeratedValue><name>HSE</name><description>HSE selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL2_Q</name><description>pll2_q selected as peripheral clock</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SWPSEL</name>
              <description>SWPMI kernel clock source
              selection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SWPSEL</name><usage>read-write</usage><enumeratedValue><name>PCLK</name><description>pclk selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D2CCIP2R</name>
          <displayName>D2CCIP2R</displayName>
          <description>RCC Domain 2 Kernel Clock Configuration
          Register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USART234578SEL</name>
              <description>USART2/3, UART4,5, 7/8 (APB1) kernel
              clock source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>USART234578SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK1</name><description>rcc_pclk1 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_Q</name><description>pll2_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_Q</name><description>pll3_q selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USART16SEL</name>
              <description>USART1 and 6 kernel clock source
              selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>USART16SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK2</name><description>rcc_pclk2 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_Q</name><description>pll2_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_Q</name><description>pll3_q selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RNGSEL</name>
              <description>RNG kernel clock source
              selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>RNGSEL</name><usage>read-write</usage><enumeratedValue><name>HSI48</name><description>HSI48 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI selected as peripheral clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>I2C123SEL</name>
              <description>I2C1,2,3 kernel clock source
              selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>I2C123SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK1</name><description>rcc_pclk1 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL3_R</name><description>pll3_r selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>USBSEL</name>
              <description>USBOTG 1 and 2 kernel clock source
              selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>USBSEL</name><usage>read-write</usage><enumeratedValue><name>DISABLE</name><description>Disable the kernel clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_Q</name><description>pll3_q selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI48</name><description>HSI48 selected as peripheral clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CECSEL</name>
              <description>HDMI-CEC kernel clock source
              selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>CECSEL</name><usage>read-write</usage><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>LPTIM1 kernel clock source
              selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>LPTIM1SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK1</name><description>rcc_pclk1 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_P</name><description>pll2_p selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_R</name><description>pll3_r selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>PER</name><description>PER selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D3CCIPR</name>
          <displayName>D3CCIPR</displayName>
          <description>RCC Domain 3 Kernel Clock Configuration
          Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPUART1SEL</name>
              <description>LPUART1 kernel clock source
              selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>LPUART1SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK_D3</name><description>rcc_pclk_d3 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_Q</name><description>pll2_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_Q</name><description>pll3_q selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>I2C4SEL</name>
              <description>I2C4 kernel clock source
              selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>I2C4SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK4</name><description>rcc_pclk4 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL3_R</name><description>pll3_r selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <description>LPTIM2 kernel clock source
              selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>LPTIM2SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK4</name><description>rcc_pclk4 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_P</name><description>pll2_p selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_R</name><description>pll3_r selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>LSE</name><description>LSE selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>LSI</name><description>LSI selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>PER</name><description>PER selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LPTIM345SEL</name>
              <description>LPTIM3,4,5 kernel clock source
              selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="LPTIM2SEL" />
            </field>
            <field>
              <name>ADCSEL</name>
              <description>SAR ADC kernel clock source
              selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>ADCSEL</name><usage>read-write</usage><enumeratedValue><name>PLL2_P</name><description>pll2_p selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL3_R</name><description>pll3_r selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PER</name><description>PER selected as peripheral clock</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAI4ASEL</name>
              <description>Sub-Block A of SAI4 kernel clock source
              selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SAI4ASEL</name><usage>read-write</usage><enumeratedValue><name>PLL1_Q</name><description>pll1_q selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_P</name><description>pll2_p selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_P</name><description>pll3_p selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>I2S_CKIN</name><description>i2s_ckin selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>PER</name><description>PER selected as peripheral clock</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAI4BSEL</name>
              <description>Sub-Block B of SAI4 kernel clock source
              selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SAI4ASEL" />
            </field>
            <field>
              <name>SPI6SEL</name>
              <description>SPI6 kernel clock source
              selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>SPI6SEL</name><usage>read-write</usage><enumeratedValue><name>RCC_PCLK4</name><description>rcc_pclk4 selected as peripheral clock</description><value>0</value></enumeratedValue><enumeratedValue><name>PLL2_Q</name><description>pll2_q selected as peripheral clock</description><value>1</value></enumeratedValue><enumeratedValue><name>PLL3_Q</name><description>pll3_q selected as peripheral clock</description><value>2</value></enumeratedValue><enumeratedValue><name>HSI_KER</name><description>hsi_ker selected as peripheral clock</description><value>3</value></enumeratedValue><enumeratedValue><name>CSI_KER</name><description>csi_ker selected as peripheral clock</description><value>4</value></enumeratedValue><enumeratedValue><name>HSE</name><description>HSE selected as peripheral clock</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>RCC Clock Source Interrupt Enable
          Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSIRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE ready Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI ready Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE ready Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>CSIRDYIE</name>
              <description>CSI ready Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>HSI48RDYIE</name>
              <description>RC48 ready Interrupt
              Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>PLL1RDYIE</name>
              <description>PLL1 ready Interrupt
              Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>PLL2RDYIE</name>
              <description>PLL2 ready Interrupt
              Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>PLL3RDYIE</name>
              <description>PLL3 ready Interrupt
              Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
            <field>
              <name>LSECSSIE</name>
              <description>LSE clock security system Interrupt
              Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="LSIRDYIE" />
            </field>
          </fields>
        </register>
