tinygo-org/stm32-svd/svd/stm32h743v.svd
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>Control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>RTOEN</name>
              <description>Receiver timeout enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RTOEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Receiver timeout feature disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Receiver timeout feature enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ABREN</name>
              <description>Auto baud rate enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ABREN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Auto baud rate detection is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Auto baud rate detection is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MSBFIRST</name>
              <description>Most significant bit first</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MSBFIRST</name><usage>read-write</usage><enumeratedValue><name>LSB</name><description>data is transmitted/received with data bit 0 first, following the start bit</description><value>0</value></enumeratedValue><enumeratedValue><name>MSB</name><description>data is transmitted/received with MSB (bit 7/8/9) first, following the start bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DATAINV</name>
              <description>Binary data inversion</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DATAINV</name><usage>read-write</usage><enumeratedValue><name>Positive</name><description>Logical data from the data register are send/received in positive/direct logic</description><value>0</value></enumeratedValue><enumeratedValue><name>Negative</name><description>Logical data from the data register are send/received in negative/inverse logic</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TXINV</name>
              <description>TX pin active level
              inversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TXINV</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>TX pin signal works using the standard logic levels</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>TX pin signal values are inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RXINV</name>
              <description>RX pin active level
              inversion</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RXINV</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>RX pin signal works using the standard logic levels</description><value>0</value></enumeratedValue><enumeratedValue><name>Inverted</name><description>RX pin signal values are inverted</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap TX/RX pins</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SWAP</name><usage>read-write</usage><enumeratedValue><name>Standard</name><description>TX/RX pins are used as defined in standard pinout</description><value>0</value></enumeratedValue><enumeratedValue><name>Swapped</name><description>The TX and RX pins functions are swapped</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LINEN</name>
              <description>LIN mode enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LINEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>LIN mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>LIN mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>STOP</name><usage>read-write</usage><enumeratedValue><name>Stop1</name><description>1 stop bit</description><value>0</value></enumeratedValue><enumeratedValue><name>Stop0p5</name><description>0.5 stop bit</description><value>1</value></enumeratedValue><enumeratedValue><name>Stop2</name><description>2 stop bit</description><value>2</value></enumeratedValue><enumeratedValue><name>Stop1p5</name><description>1.5 stop bit</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLKEN</name>
              <description>Clock enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>CK pin disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>CK pin enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPOL</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Steady low value on CK pin outside transmission window</description><value>0</value></enumeratedValue><enumeratedValue><name>High</name><description>Steady high value on CK pin outside transmission window</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock phase</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPHA</name><usage>read-write</usage><enumeratedValue><name>First</name><description>The first clock transition is the first data capture edge</description><value>0</value></enumeratedValue><enumeratedValue><name>Second</name><description>The second clock transition is the first data capture edge</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LBCL</name>
              <description>Last bit clock pulse</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LBCL</name><usage>read-write</usage><enumeratedValue><name>NotOutput</name><description>The clock pulse of the last data bit is not output to the CK pin</description><value>0</value></enumeratedValue><enumeratedValue><name>Output</name><description>The clock pulse of the last data bit is output to the CK pin</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LBDIE</name>
              <description>LIN break detection interrupt
              enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LBDIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is inhibited</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>An interrupt is generated whenever LBDF=1 in the ISR register</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LBDL</name>
              <description>LIN break detection length</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LBDL</name><usage>read-write</usage><enumeratedValue><name>Bit10</name><description>10-bit break detection</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit11</name><description>11-bit break detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADDM7</name>
              <description>7-bit Address Detection/4-bit Address
              Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ADDM7</name><usage>read-write</usage><enumeratedValue><name>Bit4</name><description>4-bit address detection</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit7</name><description>7-bit address detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DIS_NSS</name>
              <description>When the DSI_NSS bit is set, the NSS pin
              input is ignored</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLVEN</name>
              <description>Synchronous Slave mode
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field><name>ABRMOD</name><description>Auto baud rate mode</description><bitOffset>21</bitOffset><bitWidth>2</bitWidth><enumeratedValues><name>ABRMOD</name><usage>read-write</usage><enumeratedValue><name>Start</name><description>Measurement of the start bit is used to detect the baud rate</description><value>0</value></enumeratedValue><enumeratedValue><name>Edge</name><description>Falling edge to falling edge measurement</description><value>1</value></enumeratedValue><enumeratedValue><name>Frame7F</name><description>0x7F frame detection</description><value>2</value></enumeratedValue><enumeratedValue><name>Frame55</name><description>0x55 frame detection</description><value>3</value></enumeratedValue></enumeratedValues>
            </field><field><name>ADD</name><description>Address of the USART node</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field></fields>
        </register>
