tinygo-org/stm32-svd/svd/stm32h743v.svd
    <peripheral><name>DBGMCU</name><description>Debug support</description><groupName>DBG</groupName><baseAddress>1543507968</baseAddress><addressBlock><offset>0</offset><size>256</size><usage>registers</usage></addressBlock><registers><register><name>IDC</name><description>Identity code</description><addressOffset>0</addressOffset><access>read-only</access><resetValue>268461184</resetValue><fields><field><name>REV_ID</name><description>Revision ID</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
            <field><name>DEV_ID</name><description>Device ID</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>CR</name><description>Configuration register</description><addressOffset>4</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>TRGOEN</name><description>External trigger output enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>D3DBGCKEN</name><description>D3 debug clock enable enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>D1DBGCKEN</name><description>D1 debug clock enable enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TRACECLKEN</name><description>Trace clock enable enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DBGSTBY_D1</name><description>Allow debug in D1 Standby mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DBGSTOP_D1</name><description>Allow debug in D1 Stop mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DBGSLEEP_D1</name><description>Allow debug in D1 Sleep mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>APB3FZ1</name><description>APB3 peripheral freeze register</description><addressOffset>52</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>WWDG1</name><description>WWDG1 stop in debug mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>APB1LFZ1</name><description>APB1L peripheral freeze register</description><addressOffset>60</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>I2C3</name><description>I2C3 SMBUS timeout stop in debug mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>I2C2</name><description>I2C2 SMBUS timeout stop in debug mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>I2C1</name><description>I2C1 SMBUS timeout stop in debug mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPTIM1</name><description>LPTIM1 stop in debug mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM14</name><description>TIM14 stop in debug mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM13</name><description>TIM13 stop in debug mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM12</name><description>TIM12 stop in debug mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM7</name><description>TIM7 stop in debug mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM6</name><description>TIM6 stop in debug mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM5</name><description>TIM5 stop in debug mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM4</name><description>TIM4 stop in debug mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM3</name><description>TIM3 stop in debug mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM2</name><description>TIM2 stop in debug mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>APB2FZ1</name><description>APB2 peripheral freeze register</description><addressOffset>76</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>HRTIM</name><description>HRTIM stop in debug mode</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM17</name><description>TIM17 stop in debug mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM16</name><description>TIM16 stop in debug mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM15</name><description>TIM15 stop in debug mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM8</name><description>TIM8 stop in debug mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TIM1</name><description>TIM1 stop in debug mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>APB4FZ1</name><description>APB4 peripheral freeze register</description><addressOffset>84</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>IWDG1</name><description>Independent watchdog for D1 stop in debug mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RTC</name><description>RTC stop in debug mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPTIM5</name><description>LPTIM5 stop in debug mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPTIM4</name><description>LPTIM4 stop in debug mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPTIM3</name><description>LPTIM3 stop in debug mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPTIM2</name><description>LPTIM2 stop in debug mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>I2C4</name><description>I2C4 SMBUS timeout stop in debug mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        </registers></peripheral>
    <peripheral><name>RAMECC1</name><description>RAM ECC monitoring</description><groupName>RAMECC</groupName><baseAddress>1375768576</baseAddress><interrupt><name>RAMECC</name><description>ECC diagnostic global interrupt for all RAMECC controllers</description><value>145</value></interrupt>
    <registers><register><name>IER</name><description>RAMECC interrupt enable register</description><addressOffset>0</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>GECCDEBWIE</name><description>Global ECC double error on byte write interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GECCDEIE</name><description>Global ECC double error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GECCSEIE</name><description>Global ECC single error interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>GIE</name><description>Global interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1CR</name><description>RAMECC monitor 1 configuration register</description><addressOffset>32</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1SR</name><description>RAMECC monitor 1 status register</description><addressOffset>36</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M1FAR</name><description>RAMECC monitor 1 failing address register</description><addressOffset>40</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FDRL</name><description>RAMECC monitor 1 failing data low register</description><addressOffset>44</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FDRH</name><description>RAMECC monitor 1 failing data high register</description><addressOffset>48</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M1FECR</name><description>RAMECC monitor 1 failing error code register</description><addressOffset>52</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2CR</name><description>RAMECC monitor 2 configuration register</description><addressOffset>64</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M2SR</name><description>RAMECC monitor 2 status register</description><addressOffset>68</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M2FAR</name><description>RAMECC monitor 2 failing address register</description><addressOffset>72</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FDRL</name><description>RAMECC monitor 2 failing data low register</description><addressOffset>76</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FDRH</name><description>RAMECC monitor 2 failing data high register</description><addressOffset>80</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M2FECR</name><description>RAMECC monitor 2 failing error code register</description><addressOffset>84</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3CR</name><description>RAMECC monitor 3 configuration register</description><addressOffset>96</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M3SR</name><description>RAMECC monitor 3 status register</description><addressOffset>100</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M3FAR</name><description>RAMECC monitor 3 failing address register</description><addressOffset>104</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3FDRL</name><description>RAMECC monitor 3 failing data low register</description><addressOffset>108</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3FDRH</name><description>RAMECC monitor 3 failing data high register</description><addressOffset>112</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M3FECR</name><description>RAMECC monitor 3 failing error code register</description><addressOffset>116</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M4CR</name><description>RAMECC monitor 4 configuration register</description><addressOffset>128</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M4SR</name><description>RAMECC monitor 4 status register</description><addressOffset>132</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M4FAR</name><description>RAMECC monitor 4 failing address register</description><addressOffset>136</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M4FDRL</name><description>RAMECC monitor 4 failing data low register</description><addressOffset>140</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M4FDRH</name><description>RAMECC monitor 4 failing data high register</description><addressOffset>144</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M4FECR</name><description>RAMECC monitor 4 failing error code register</description><addressOffset>148</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FEC</name><description>ECC failing code</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M5CR</name><description>RAMECC monitor 5 configuration register</description><addressOffset>160</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>ECCELEN</name><description>ECC error context latching enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEBWIE</name><description>ECC double error on byte write interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCDEIE</name><description>ECC double error interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>ECCSEIE</name><description>ECC single error interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M5SR</name><description>RAMECC monitor 5 status register</description><addressOffset>164</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>DEBWDF</name><description>ECC double error on byte write flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>DEDF</name><description>ECC double error detected flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            <field><name>SEDCF</name><description>ECC single error detected flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields></register>
        <register><name>M5FAR</name><description>RAMECC monitor 5 failing address register</description><addressOffset>168</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FADD</name><description>ECC failing address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M5FDRL</name><description>RAMECC monitor 5 failing data low register</description><addressOffset>172</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAL</name><description>ECC failing data low</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
        <register><name>M5FDRH</name><description>RAMECC monitor 5 failing data high register</description><addressOffset>176</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>FDATAH</name><description>ECC failing data high</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
            </fields></register>
